{
	"help_expr": [
		"- sqrt(x): square root of x",
		"- abs(x): absolute value of x",
		"- ln(x): log with base e",
		"- log10(x): base 10 logarithm of x",
		"- log(x): same as log10(x)",
		"- sin(x): Sine of x",
		"- cos(x): Cosine of x",
		"- tan(x): Tangent of x",
		"- asin(x): arcsine of x",
		"- acos(x): arccosine of x",
		"- atan(x): arctangent of x",
		"- atan2, sinh, cosh, tanh, asinh, acosh, atanh",
		"- floor, ceil, round, signum"
	],
	"help_vars": [
		"- Euler's number is supported via 'E' (note it being uppercase)",
		"- PI is available through 'pi' or 'π'"
	],
	"help_panel": [
		"- The 'Panel' button on the top bar toggles if the side bar should be shown or not. This can also be accomplished by pressing the 'h' key.",
		"- The 'Add Function' button on the top panel adds a new function to be graphed. You can then configure that function in the side panel.",
		"- The 'Help' button on the top bar opens and closes this window!",
		"- The 'Info' button provides information on the build currently running.",
		"- The Sun/Moon button toggles Dark and Light mode."
	],
	"help_function": [
		"- The 'X' button before the '∫' button allows you to delete the function in question. Deleting a function is prevented if only 1 function exists.",
		"- The ∫ button (between the 'X' and 'd/dx' buttons) indicates whether to integrate the function in question.",
		"- The 'd/dx' button next to the function input indicates whether or not calculating the derivative is enabled or not."
	],
	"help_other": [
		"- Extrema (local minimums and maximums) and Roots (intersections with the x-axis) are displayed though yellow and light blue points on the graph. You can toggle these in the Side Panel.",
		"- In some edge cases, math functions may not parse correctly. More specifically with implicit multiplication. If you incounter this issue, please do report it on the project's Github page (linked on the side panel). But a current workaround would be explicitly stating a multiplication operation through the use of an asterisk."
	],
	"license_info": "The AGPL license ensures that the end user, even if not hosting the program itself, is still guaranteed access to the source code of the project in question."
}
